// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//  const random = (min, max) => {
//     return Math.floor(Math.random() * (max - min + 1)) + min;
// }
// let time = random(0,59)
//
// if (time<=15){
//     console.log("1")
// }else if (time>15 && time<=30){
//     console.log("2")
// }else if (time>30 && time<=45){
//     console.log("3")
// }else {console.log("4")}


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє
// це число (у першу, другу чи третю).
// const random = (min, max) => {
//     return Math.floor(Math.random() * (max - min + 1)) + min;
// }
// let a = random(1,31)
//
// if (a<=10){
//     console.log("1 декада")
// }else if (a>10 && a<=20){
//     console.log("2 декада")
// } else {console.log("3 декада")}


// У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let a = false
// if (a!==true){
//     console.log("Вірно")
// } else {
//     console.log("Неправильно")
// }
//
// let a = true
// if (a!==true){
//     console.log("Вірно")
// } else {
//     console.log("Неправильно")
// }


// Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = 0
// if (a!==0){
//     console.log("Вірно")
// }else {console.log("Невірно")}


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//
// let a = 7
// switch (a){
//     case 1:
//         console.log("Понеділок йдемо на роботу");
//         break
//     case 2:
//         console.log("Понеділок йдемо на роботу другий день")
//         break
//     case 3:
//         console.log("Понеділок йдемо на роботу, вже сил нема");
//         break
//     case 4:
//         console.log("Понеділок йдемо на роботу сил 0");
//         break
//     case 5:
//         console.log("Понеділок йдемо на роботу, завтра вихідний");
//         break
//     case 6:
//         console.log("Вихідний перший");
//         break
//     case 7:
//         console.log("Вихідний другий")
//
//
//
// }





// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let  a = 2024
// if (a%4==0 && a%100!=0 || a%400==0){
//     console.log("Високосний рік")
// }else{console.log("Звичайний рік")}




