// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
// let a = 55
// let b = 55
// if (a>b){
//     console.log(a)
// }else if (a<b){
//     console.log(b)
// }else {console.log(a,b)}
//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let random = (min, max) => {
//     return Math.floor(Math.random() * (max - min + 1)) + min;
// }
// let a = random(1,90)
//
// if (a<=20){
//     console.log("1")
// }else if (a>20 && a<=48){
//     console.log("2")
// } else {console.log("3")}

// Ми маємо змінну number в яку користувач задає числове значення,
//     якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let random = (min, max) => {
//     return Math.floor(Math.random() * (max - min + 1)) + min;
// }
// let a = random(7,10)
//
// if (a===10){
//     console.log("Вірно")
// }else {console.log("Невірно")}


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = 0
// if (typeof x===typeof 0){
//     console.log(1)
// }else if (typeof x===typeof "str"){
//     console.log(2)
// }else if (typeof x ===typeof true){
//     console.log(3)
// } else if (typeof x=== typeof Math || typeof x===typeof []){
//     console.log(4)
// }


// Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let a = 9
// if (a>=10 && a<=22){
//     console.log("йдемо ВЧИТИСЯ")
// }else {console.log("сидимо вдома і вчимося ОНЛАЙН")}

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

 // let random = (min, max) => {
 //    return Math.floor(Math.random() * (max - min + 1)) + min;
// }
// let a = random(1,5)
//
// switch (a){
//     case 1:
//         console.log("Авто")
//         break
//     case 2:
//         console.log("Мото")
//         break
//     case 3:
//         console.log("Телефон")
//         break
//     case 4:
//         console.log("ТВ")
//         break
//     default:
//         console.log("невірно")
//         break
// }
